app/Controllers/AdminDashboardController.php

    public function index()
    {
        try {
            $currentMonth = date('Y-m');
            $currentYear = date('Y');

            // Total penjualan (jumlah transaksi selesai)
            $totalSales = $this->transaction
                ->where('status', '2')
                ->countAllResults();

            // Total penjualan bulan ini
            $monthlySales = $this->transaction
                ->where('status', '2')
                ->where('DATE_FORMAT(created_at, "%Y-%m")', $currentMonth)
                ->countAllResults();

            // Total pendapatan (revenue) dari transaksi selesai
            $revenueResult = $this->transaction
                ->selectSum('total_harga')
                ->where('status', '2')
                ->get()
                ->getRow();
            $totalRevenue = $revenueResult ? $revenueResult->total_harga : 0;

            // Total pendapatan bulan ini
            $monthlyRevenueResult = $this->transaction
                ->selectSum('total_harga')
                ->where('status', '2')
                ->where('DATE_FORMAT(created_at, "%Y-%m")', $currentMonth)
                ->get()
                ->getRow();
            $monthlyRevenue = $monthlyRevenueResult ? $monthlyRevenueResult->total_harga : 0;

            // Total customer unik yang sudah melakukan transaksi selesai
            $totalCustomersQuery = $this->transaction
                ->select('username')
                ->where('status', '2')
                ->findAll();
            $totalCustomers = count(array_unique(array_column($totalCustomersQuery, 'username')));

            // Customer baru bulan ini
            $newCustomersQuery = $this->transaction
                ->select('username')
                ->where('status', '2')
                ->where('DATE_FORMAT(created_at, "%Y-%m")', $currentMonth)
                ->findAll();
            $newCustomers = count(array_unique(array_column($newCustomersQuery, 'username')));

            // Data transaksi terbaru (10 transaksi terakhir, status selesai)
            $recentTransactions = $this->transaction
                ->where('status', '2')
                ->orderBy('created_at', 'DESC')
                ->limit(10)
                ->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `transaction`
WHERE `status` = '2'
SELECT COUNT(*) AS `numrows`
FROM `transaction`
WHERE `status` = '2'
AND DATE_FORMAT(created_at, "%Y-%m") = '2025-07'
SELECT *
FROM `transaction`
WHERE `status` = '2'
SELECT SUM(`total_harga`) AS `total_harga`
FROM `transaction`
WHERE `status` = '2'
SELECT SUM(`total_harga`) AS `total_harga`
FROM `transaction`
WHERE `status` = '2'
AND DATE_FORMAT(created_at, "%Y-%m") = '2025-07'
SELECT `username`
FROM `transaction`
WHERE `status` = '2'
SELECT `username`
FROM `transaction`
WHERE `status` = '2'
AND DATE_FORMAT(created_at, "%Y-%m") = '2025-07'
SELECT *
FROM `transaction`
WHERE `status` = '2'
ORDER BY `created_at` DESC
 LIMIT 10

            $recentTransactionDetails = [];
            foreach ($recentTransactions as $transaction) {
                try {
                    $details = $this->transaction_detail
                        ->select('product.nama, transaction_detail.jumlah')
                        ->join('product', 'transaction_detail.product_id = product.id', 'left')
                        ->where('transaction_id', $transaction['id'])
                        ->findAll();
---
SELECT `product`.`nama`, `transaction_detail`.`jumlah`
FROM `transaction_detail`
LEFT JOIN `product` ON `transaction_detail`.`product_id` = `product`.`id`
WHERE `transaction_id` = '47'

                $month = date('Y-m', strtotime("-$i months"));
                $monthName = date('M Y', strtotime("-$i months"));

                $sales = $this->transaction
                    ->where('status', '2')
                    ->where('DATE_FORMAT(created_at, "%Y-%m")', $month)
                    ->countAllResults();

                $revenueResult = $this->transaction
                    ->selectSum('total_harga')
                    ->where('status', '2')
                    ->where('DATE_FORMAT(created_at, "%Y-%m")', $month)
                    ->get()
                    ->getRow();
                $revenue = $revenueResult ? $revenueResult->total_harga : 0;

                $customersQuery = $this->transaction
                    ->select('username')
                    ->where('status', '2')
                    ->where('DATE_FORMAT(created_at, "%Y-%m")', $month)
                    ->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `transaction`
WHERE `status` = '3'
AND DATE_FORMAT(created_at, "%Y-%m") = '2025-02'
SELECT SUM(`total_harga`) AS `total_harga`
FROM `transaction`
WHERE `status` = '3'
AND DATE_FORMAT(created_at, "%Y-%m") = '2025-02'
SELECT `username`
FROM `transaction`
WHERE `status` = '3'
AND DATE_FORMAT(created_at, "%Y-%m") = '2025-02'


            // Top 5 produk terlaris
            try {
                $topProducts = $this->transaction_detail
                    ->select('product.nama, product.harga, product.foto, SUM(transaction_detail.jumlah) as total_sold')
                    ->join('product', 'transaction_detail.product_id = product.id', 'left')
                    ->join('transaction', 'transaction_detail.transaction_id = transaction.id')
                    ->where('transaction.status', '2')
                    ->where('product.id IS NOT NULL')
                    ->groupBy('product.id, product.nama, product.harga, product.foto')
                    ->orderBy('total_sold', 'DESC')
                    ->limit(5)
                    ->findAll();
---
SELECT `product`.`nama`, `product`.`harga`, `product`.`foto`, SUM(transaction_detail.jumlah) as total_sold
FROM `transaction_detail`
LEFT JOIN `product` ON `transaction_detail`.`product_id` = `product`.`id`
JOIN `transaction` ON `transaction_detail`.`transaction_id` = `transaction`.`id`
WHERE `transaction`.`status` = '3'
AND `product`.`id` IS NOT NULL
GROUP BY `product`.`id`, `product`.`nama`, `product`.`harga`, `product`.`foto`
ORDER BY `total_sold` DESC
 LIMIT 5