app/Controllers/AdminDashboardController.php

SELECT *
FROM `transaction`
---
    public function index()
    {
        try {
            $currentMonth = date('Y-m');
            $currentYear = date('Y');

            // Debug: Cek apakah ada transaksi selesai
            $allTransactions = $this->transaction->findAll();