app/Controllers/AdminDashboardController.php

SELECT *
FROM `transaction`
ORDER BY `created_at` DESC
 LIMIT 10
---
            $newCustomers = count(array_unique(array_column($newCustomersQuery, 'username')));

            // Data transaksi terbaru (10 transaksi terakhir, semua status)
            $recentTransactions = $this->transaction
                ->orderBy('created_at', 'DESC')
                ->limit(10)
                ->findAll();