app/Controllers/AdminTransaksiController.php

    public function index()
    {
        $tanggal_dari = $this->request->getGet('tanggal_dari');
        $tanggal_sampai = $this->request->getGet('tanggal_sampai');
        $builder = $this->transaction;
        if ($tanggal_dari && $tanggal_sampai) {
            $builder = $builder->where('DATE(created_at) >=', $tanggal_dari)->where('DATE(created_at) <=', $tanggal_sampai);
        } elseif ($tanggal_dari) {
            $builder = $builder->where('DATE(created_at) >=', $tanggal_dari);
        } elseif ($tanggal_sampai) {
            $builder = $builder->where('DATE(created_at) <=', $tanggal_sampai);
        }
        $buy = $builder->findAll();
        $product = [];
        if (!empty($buy)) {
            foreach ($buy as $item) {
                $detail = $this->transaction_detail
                    ->select('transaction_detail.*, product.nama, product.harga, product.foto')
                    ->join('product', 'transaction_detail.product_id=product.id')
                    ->where('transaction_id', $item['id'])
                    ->findAll();
---
SELECT *
FROM `transaction`
WHERE DATE(created_at) >= '2025-07-03'
AND DATE(created_at) <= '2025-07-04'
SELECT `transaction_detail`.*, `product`.`nama`, `product`.`harga`, `product`.`foto`
FROM `transaction_detail`
JOIN `product` ON `transaction_detail`.`product_id`=`product`.`id`
WHERE `transaction_id` = '35'