app/Controllers/AuthController.php

SELECT *
FROM `user`
WHERE `username` = 'ina25'
 LIMIT 1
---
    public function login()
    {
        // Jika sudah login admin, destroy session agar bisa login customer di window lain
        if (session()->get('isLoggedIn') && session()->get('role') === 'admin') {
            session()->destroy();
        } elseif (session()->get('isLoggedIn')) {
            return redirect()->to(base_url('home'));
        }

        if ($this->request->getPost()) {
            $rules = [
                'username' => 'required|min_length[3]',
                'password' => 'required|min_length[6]', // perbaikan: tidak harus numeric, cukup minimal 6 karakter
            ];

            if ($this->validate($rules)) {
                $username = $this->request->getVar('username');
                $password = $this->request->getVar('password');

                $dataUser = $this->user->where(['username' => $username])->first(); //pasw 1234567