app/Controllers/Home.php

SELECT *
FROM `product`
---
    public function index(): string
    {
        $product = $this->product->findAll();

SELECT *
FROM `transaction`
WHERE `username` = 'i123'
---
    public function profile()
{
    $username = session()->get('username');
    $data['username'] = $username;

    $buy = $this->transaction->where('username', $username)->findAll();