app/Controllers/TransaksiController.php

    public function update_status($id)
{
    $status = $this->request->getPost('status');
    $page = $this->request->getGet('datatable_page');
    if ($status !== null) {
        $this->transaction->update($id, [
            'status' => $status,
            'updated_at' => date('Y-m-d H:i:s')
        ]);
---
UPDATE `transaction` SET `status` = '2', `updated_at` = '2025-07-05 07:15:02'
WHERE `transaction`.`id` IN ('39')